{"date": "2025-01-06", "project": "diss3", "text": "I can identify mentions of states in text and summarize the context of the state mentions. I need to build a typology of state mentions. I have seen this is possible using Claude and just throwing a lot of data at it. However, I need to figure out a way to do this systematically and with a lower-cost language model. I think that the way forward is with some kind of progressive or batched loading; fit a sub-set of summary sentences within a prompt and typologize. The challenges are how to iteratively develop a typology that captures specificity and that also reduces dimensionality? How to both try to fit cases to an existing typology and also progressively expand that typology as new data is incorporated? There is also the matter of the typology itself. To keep this grounded, I want to focus on actions or practices; state 1 does something to state 2 (and potentially other states in the process). The typology might be disaggregated into different components, some of which are mutually exclusive and others that are additive. For example, a direct denunciation cannot also be a compliment. However, a context could mention both security and economic measures. These might work in a mutually reinforcing way. There are two immediate experiments: [progressive_typing]: From context summary, go directly to 'types' of mentions at the doc_id level; then progressively build and reconcile the typology with different groupings of doc_id values. Reconcile working up. Potentially reductive and intransparent. [tagging]: Tag speeches, then reconcile tags; at end, build typology of speeches from family resemblance between tags. Potentially too specific and requiring tough reconciliation between tags. What is the way forward? The immediate priority is to come up with a method for deriving a typology. I need to execute this over a sub-set of the data and do some initial analysis, while discussing the limitations. Once this step is complete, I need to revisit parts 1 and 2 to improve their function and to demonstrate evaluation metrics. I need to be able to formally express my confidence in the NER technique, specifically around tough disambiguations. I also need to be able to express my confidence in the quality of summarization. [progressive typing] Approach 1: Start with annotated data. Filter for favorite context summary so that I'm working with high quality summaries. Prompt1: zeroshot_type_01 doc_id level typing prompt that works with summaries from a given doc_id. There is no pre-set typology, so this is a zero-shot prompt. Goal - for all context_summary in doc_id, context_summary --> type_initial. The output of this step will be too specific. I will need to reconcile the typology and likely reduce the number of types so that the labels are more encompassing and can group related types together. Evaluation: human evaluation to assess the quality of the typology and to simplify the moving parts. This could be a time to distinguish between labels and tags. Question: would the typologizing process be improved by including multiple samples at once? I want to have a typologizing prompt. I want the model to both think about the typology scheme and apply it as it goes.I can't throw all of the contexts at it all at once. Typologizing is also an iterative process that develops over several readings through of the text. Initial typology from i. e. 10 Typology rationale + Typology applied. Maybe what I should do first is generate a series of typology rationales from subsets of documents. Then, save those rationales and adjudicate between them in aggregate. Then apply the rationale to the documents. Step 1: derive a typology from sub-set of documents.Input: subset of context summaries Output: typology rationale Step 2: derive a typology from the full set of documents. Input: typology rationales Output: full typology codebook Step}: apply the typology to the individual documents. p­rompt 1: typology induction Prompt 2: typology synthesis Prompt 3: typology application The input order may affect the typology. It would be good to be able to replicate the process with an alternate order and compare. The typology should refer to a type of action, a discursive or rhetoricalaction. Think theoretically about the prompt.Naming names is a discursive practice. It does something. It is explicit. It is not obligatory and it can sometimes bring about contradictions. An example in how Peru criticizes great powers but praises the United States. It is an action and it operates on a relationship that can be bi - or poly- lateral. It reflects a jostling for position."}
{"date": "2025-01-07", "project": "diss3", "text": "In general, my goal today is to go through the high-quality evaluated data I have already assembled and use it to test typologize prompts. Leading up to the winter break, I ran a series of summarizing prompts and evaluated them, identifying which were my favorites and which were adequate and rich enough. From this, I can create a subset of high-quality, gold-standard evaluation data. While this subset is not complete and doesn't cover a full year, it is sufficiently comprehensive and of high quality for testing purposes. After completing this third step in the process by building a prototype, I can then go back and refine each of the earlier steps. This marks the final phase of research and development, after which I can shift my focus toward scaling."}